Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [10]:
a=pd.Series(data=[4, 8, 15, 16, 23,42])

In [11]:
print(a)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

<br>
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [12]:
my_list=['a','b',1,2,3,19.3,12.2,'qwerty',123,12233.3323]

In [13]:
b=pd.Series(data=my_list)
print(b)

0             a
1             b
2             1
3             2
4             3
5          19.3
6          12.2
7        qwerty
8           123
9    12233.3323
dtype: object

<br>
<bR>

Q3. Create a Pandas DataFrame that contains the following data:
Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female
Then, print the DataFrame.

In [49]:
# Using List
data=[['Alice',25,'Female'],['Bob',30,'Male'],['Claire',27,'Female']]

In [50]:
df1=pd.DataFrame(data=data,columns=['Name','Age','Gender'])

In [51]:
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [52]:
print(df1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [53]:
# Using dict
data1={'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}
df2=pd.DataFrame(data=data1)

In [54]:
print(df2)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

<br>
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Pandas DataFrame is a 2-dimensional labeled data structure like any table with rows and columns. The size and values of the dataframe are mutable,i.e., can be modified. It is the most commonly used pandas object. Pandas DataFrame can be created in multiple ways.
<br>
<br>
A pandas series is a one-dimensional data structure that comprises of key-value pair, where keys/labels are the indices and values are the values stored on that index. It is similar to a python dictionary, except it provides more freedom to manipulate and edit the data

In [45]:
# E.G.
series=pd.Series(data=[1,2,3,4,5])
print(series)
dataframe=pd.DataFrame(data=[[1,2,3],[3,4,5],[5,6,7]],columns=['a','b','c'])
print(dataframe)

0    1
1    2
2    3
3    4
4    5
dtype: int64
   a  b  c
0  1  2  3
1  3  4  5
2  5  6  7

<br>

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [55]:
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [56]:
df1.head(2) # print first n rows

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [57]:
df1.tail(3) # print last n rows

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [59]:
df1.columns # print out all the columns of the dataset

Index(['Name', 'Age', 'Gender'], dtype='object')

In [60]:
len(df1) # Provides with the length of the DataFrame.

3

In [62]:
df1.describe() # provides some basic statistical measures

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [68]:
df1.dtypes # data types of the variables

Name      object
Age        int64
Gender    object
dtype: object

<br>
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series: Size-immutable – Once created, the size of a Series object cannot be changed.
<br>
DataFrame: Size-mutable – Elements can be dropped or added in an existing DataFrame.
<br>
Panel – 3D labeled size mutable array

All pandas data structures are value-mutable (the values they contain can be altered) but not always size-mutable. The length of a Series cannot be changed, but, for example, columns can be inserted into a DataFrame. However, the vast majority of methods produce new objects and leave the input data untouched.

<br>
Q7. Create a DataFrame using multiple Series. Explain with an example.

Creating DataFrame from Dictionary of series.
To create DataFrame from Dict of series, dictionary can be passed to form a DataFrame. The resultant index is the union of all the series of passed indexed.

In [69]:
series1=pd.Series(data=[12,34,56,78])
series2=pd.Series(data=[13,24,35,46])

In [73]:
df2=pd.DataFrame(data={'a':series1,'b':series2})

In [74]:
df2

    a   b
0  12  13
1  34  24
2  56  35
3  78  46